docs/stress-tests/stress_test.txt
** SIEGE 4.0.4
** Preparing 1 concurrent users for battle.
The server is now under siege...
Transactions:		          30 hits
Availability:		      100.00 %
Elapsed time:		        1.71 secs
Data transferred:	        3.39 MB
Response time:		        0.06 secs
Transaction rate:	       17.54 trans/sec
Throughput:		        1.98 MB/sec
Concurrency:		        0.99
Successful transactions:          30
Failed transactions:	           0
Longest transaction:	        0.10
Shortest transaction:	        0.00
 
** SIEGE 4.0.4
** Preparing 3 concurrent users for battle.
The server is now under siege...
Transactions:		          15 hits
Availability:		      100.00 %
Elapsed time:		        0.10 secs
Data transferred:	        0.00 MB
Response time:		        0.02 secs
Transaction rate:	      150.00 trans/sec
Throughput:		        0.02 MB/sec
Concurrency:		        2.60
Successful transactions:          15
Failed transactions:	           0
Longest transaction:	        0.04
Shortest transaction:	        0.00
 
** SIEGE 4.0.4
** Preparing 2 concurrent users for battle.
The server is now under siege...
Transactions:		          20 hits
Availability:		      100.00 %
Elapsed time:		        0.11 secs
Data transferred:	        0.00 MB
Response time:		        0.01 secs
Transaction rate:	      181.82 trans/sec
Throughput:		        0.02 MB/sec
Concurrency:		        1.64
Successful transactions:          20
Failed transactions:	           0
Longest transaction:	        0.05
Shortest transaction:	        0.00